Tekla.Structures.Model.UI.ViewVisibilitySettings
The View visibility settings class contains object visibility information related to view.

Tekla.Structures.Model.UI.ViewVisibilitySettings.pointsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.partsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.boltsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.boltHolesVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.weldsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.constructionPlanesVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.rebarsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.surfaceTreatmentsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.poursVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.pourBreaksVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.loadsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.cutsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.fittingsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.componentsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.gridsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.constructionLinesVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.referenceObjectsVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.buildingVisible


Tekla.Structures.Model.UI.ViewVisibilitySettings.pointsVisibleInComponents


Tekla.Structures.Model.UI.ViewVisibilitySettings.partsVisibleInComponents


Tekla.Structures.Model.UI.ViewVisibilitySettings.boltsVisibleInComponents


Tekla.Structures.Model.UI.ViewVisibilitySettings.boltHolesVisibleInComponents


Tekla.Structures.Model.UI.ViewVisibilitySettings.weldsVisibleInComponents


Tekla.Structures.Model.UI.ViewVisibilitySettings.constructionPlanesVisibleInComponents


Tekla.Structures.Model.UI.ViewVisibilitySettings.rebarsVisibleInComponents


Tekla.Structures.Model.UI.ViewVisibilitySettings.cutsVisibleInComponents


Tekla.Structures.Model.UI.ViewVisibilitySettings.fittingsVisibleInComponents


Tekla.Structures.Model.UI.ViewVisibilitySettings.componentsVisibleInComponents


Tekla.Structures.Model.UI.ViewVisibilitySettings.PointsVisible
Gets or sets the point visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.PartsVisible
Gets or sets the part visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.BoltsVisible
Gets or sets the bolt visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.BoltHolesVisible
Gets or sets the bolt hole visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.WeldsVisible
Gets or sets the weld visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.ConstructionPlanesVisible
Gets or sets the construction plane visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.RebarsVisible
Gets or sets the reinforcement visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.SurfaceTreatmentsVisible
Gets or sets the surface treatment visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.PoursVisible
Gets or sets the pour visibility.
NOTE! this setting requires that XS_ENABLE_POUR_MANAGEMENT is set to true.

Tekla.Structures.Model.UI.ViewVisibilitySettings.PourBreaksVisible
Gets or sets the pour break visibility.
NOTE! this setting requires that XS_ENABLE_POUR_MANAGEMENT is set to true.

Tekla.Structures.Model.UI.ViewVisibilitySettings.LoadsVisible
Gets or sets the load visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.CutsVisible
Gets or sets the cut or union visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.FittingsVisible
Gets or sets the fitting visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.ComponentsVisible
Gets or sets the component symbol visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.GridsVisible
Gets or sets the grid visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.ConstructionLinesVisible
Gets or sets the construction line visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.ReferenceObjectsVisible
Gets or sets the reference object visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.BuildingVisible
Gets or sets the building heirarchy visibility.

Tekla.Structures.Model.UI.ViewVisibilitySettings.PointsVisibleInComponents
Gets or sets the point visibility inside components.

Tekla.Structures.Model.UI.ViewVisibilitySettings.PartsVisibleInComponents
Gets or sets the part visibility inside components.

Tekla.Structures.Model.UI.ViewVisibilitySettings.BoltsVisibleInComponents
Gets or sets the bolt visibility inside components.

Tekla.Structures.Model.UI.ViewVisibilitySettings.BoltHolesVisibleInComponents
Gets or sets the bolt hole visibility inside components.

Tekla.Structures.Model.UI.ViewVisibilitySettings.WeldsVisibleInComponents
Gets or sets the weld visibility inside components.

Tekla.Structures.Model.UI.ViewVisibilitySettings.ConstructionPlanesVisibleInComponents
Gets or sets the construction plane visibility inside components.

Tekla.Structures.Model.UI.ViewVisibilitySettings.RebarsVisibleInComponents
Gets or sets the reinforcement visibility inside components.

Tekla.Structures.Model.UI.ViewVisibilitySettings.CutsVisibleInComponents
Gets or sets the cut visibility inside components.

Tekla.Structures.Model.UI.ViewVisibilitySettings.FittingsVisibleInComponents
Gets or sets the fitting visibility inside components.

Tekla.Structures.Model.UI.ViewVisibilitySettings.ComponentsVisibleInComponents
Gets or sets the component symbol visibility inside components.